In [2]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/Machine Learning/Pandas/children_per_woman_total_fertility.csv')

In [3]:
series_1=pd.Series(data=['sanjay','x','y','hello'],index=[1,2,3,4]);
print(series_1)

1    sanjay
2         x
3         y
4     hello
dtype: object

In [4]:
#creating a dataframe using a dictionary.
dict={
    'Names':['sanjay','rahul','nanda','dhawan','machine learning'],
    'major':['CSS','CSS','ECE','Cricket','CSS'],
    'Grades':[20,20,30,12,14]
}
persons_dataframe=pd.DataFrame(data=dict,index=[1,2,3,4,5],columns=['Names','major','Grades']);
print(persons_dataframe);

              Names    major  Grades
1            sanjay      CSS      20
2             rahul      CSS      20
3             nanda      ECE      30
4            dhawan  Cricket      12
5  machine learning      CSS      14

In [5]:
# Delving into return type of loc and other ways.
first_row_1=persons_dataframe.loc[[2]];
print(type(first_row_1))
print(first_row_1)

<class 'pandas.core.frame.DataFrame'>
   Names major  Grades
2  rahul   CSS      20

In [6]:
first_row_n=persons_dataframe.loc[2]
first_row_n.loc['major']

print(first_row_n.keys()[0])

Names

In [7]:
grades=persons_dataframe['Grades'];
print(grades);
condition1=grades>grades.mean();
print(condition1);

1    20
2    20
3    30
4    12
5    14
Name: Grades, dtype: int64
1     True
2     True
3     True
4    False
5    False
Name: Grades, dtype: bool

In [8]:
data1 = {
    'Name': [
        'Rosaline Franklin', 'William Gosset', 'Florence Nightingale',
        'Marie Curie', 'Albert Einstein', 'Ada Lovelace', 'Isaac Newton',
        'Grace Hopper', 'Alan Turing', 'Nikola Tesla'
    ],
    'Born': [
        '1920-07-25', '1876-06-13', '1820-05-12', '1867-11-07', '1879-03-14',
        '1815-12-10', '1642-01-04', '1906-12-09', '1912-06-23', '1856-07-10'
    ],
    'Died': [
        '1958-04-16', '1937-10-16', '1910-08-13', '1934-07-04', '1955-04-18',
        '1852-11-27', '1727-03-31', '1992-01-01', '1954-06-07', '1943-01-07'
    ],
    'Age': [37, 61, 90, 66, 76, 36, 84, 85, 41, 86],
    'Occupation': [
        'Chemist', 'Statistician', 'Nurse', 'Chemist', 'Physicist', 'Mathematician',
        'Physicist', 'Computer Scientist', 'Mathematician', 'Inventor'
    ]
}

scientists=pd.DataFrame(data=data1)
print(scientists)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4       Albert Einstein  1879-03-14  1955-04-18   76           Physicist
5          Ada Lovelace  1815-12-10  1852-11-27   36       Mathematician
6          Isaac Newton  1642-01-04  1727-03-31   84           Physicist
7          Grace Hopper  1906-12-09  1992-01-01   85  Computer Scientist
8           Alan Turing  1912-06-23  1954-06-07   41       Mathematician
9          Nikola Tesla  1856-07-10  1943-01-07   86            Inventor

In [9]:
first_half=scientists.loc[:4];
second_half=scientists.loc[5:];
print(first_half);
print(first_half.dtypes);

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4       Albert Einstein  1879-03-14  1955-04-18   76     Physicist
Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [10]:
# We can see that Born and Died are string objects and we need to convert them to date-time types.
scientists['Died']=pd.to_datetime(scientists['Died'],format='%Y-%m-%d');
print(scientists)
print(scientists.dtypes)

                   Name        Born       Died  Age          Occupation
0     Rosaline Franklin  1920-07-25 1958-04-16   37             Chemist
1        William Gosset  1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12 1910-08-13   90               Nurse
3           Marie Curie  1867-11-07 1934-07-04   66             Chemist
4       Albert Einstein  1879-03-14 1955-04-18   76           Physicist
5          Ada Lovelace  1815-12-10 1852-11-27   36       Mathematician
6          Isaac Newton  1642-01-04 1727-03-31   84           Physicist
7          Grace Hopper  1906-12-09 1992-01-01   85  Computer Scientist
8           Alan Turing  1912-06-23 1954-06-07   41       Mathematician
9          Nikola Tesla  1856-07-10 1943-01-07   86            Inventor
Name                  object
Born                  object
Died          datetime64[ns]
Age                    int64
Occupation            object
dtype: object

In [11]:
scientists['Born']= [
        '1920-07-25', '1876-06-13', '1820-05-12', '1867-11-07', '1879-03-14',
        '1815-12-10', '1742-01-04', '1906-12-09', '1912-06-23', '1856-07-10'
    ]
scientists['Born']=pd.to_datetime(scientists['Born'],format='%Y-%m-%d');
scientists['age_born_died']=(scientists['Born']-scientists['Died'])/365;
print(scientists)

                   Name       Born       Died  Age          Occupation  \
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4       Albert Einstein 1879-03-14 1955-04-18   76           Physicist
5          Ada Lovelace 1815-12-10 1852-11-27   36       Mathematician
6          Isaac Newton 1742-01-04 1727-03-31   84           Physicist
7          Grace Hopper 1906-12-09 1992-01-01   85  Computer Scientist
8           Alan Turing 1912-06-23 1954-06-07   41       Mathematician
9          Nikola Tesla 1856-07-10 1943-01-07   86            Inventor

                 age_born_died
0 -38 days +05:59:00.821917809
1 -62 days +14:51:36.986301370
2 -91 days +16:30:14.794520548
3 -67 days +07:13:58.356164384
4 -77 days +20:30:54.246575343
5 -37 days +00:11:50.136986302
6   14 days 18:36:29.589041095
7 -86 days +21:06:24.657534247
8 -42 days +00:23:40.273972603
9 -87 days +10:47:00.821917809

In [13]:
scientists_dropped=scientists.drop('age_born_died',axis="columns");
print(scientists_dropped)

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4       Albert Einstein 1879-03-14 1955-04-18   76           Physicist
5          Ada Lovelace 1815-12-10 1852-11-27   36       Mathematician
6          Isaac Newton 1742-01-04 1727-03-31   84           Physicist
7          Grace Hopper 1906-12-09 1992-01-01   85  Computer Scientist
8           Alan Turing 1912-06-23 1954-06-07   41       Mathematician
9          Nikola Tesla 1856-07-10 1943-01-07   86            Inventor